{"offset":"0","limit":"50","result":[{"article_date":"08.11.2023","article_voteavg":"","article_views":"","article_title":"Як налаштувати Periodic TRIM для SSD-сховища на серверах Linux","article_preview":"<p>Часто початківці-адміністратори стикаються із питаннями щодо швидкості та надійності роботи SSD-накопичувачів, які постійно здійснюють велику кількість операцій запису/зчитування. У цьому випадку швидкість їхньої роботи помітно знижується через неправи","uri":"/ukr/faq/articles/jak-nalashtuvati-periodic-trim-dlja-ssd-shovischa-na-serverah-linux/"},{"article_date":"","article_voteavg":"","article_views":"","article_title":"21 ошибка программиста PHP. Часть вторая.","article_preview":"Серьезные Ошибки. Целевая аудитория Эта статья предназначена для программистов на PHP, пытающихся избежать в своей работе самых распространенных ошибок.","uri":"/ukr/faq/articles/21-oshibka-programmista-php-chast-vtoraja/"},{"article_date":"","article_voteavg":"","article_views":"","article_title":"WEB разработка с помощью FASTTEMPLATE на PHP","article_preview":"Если Вы работали с PHP, JSP, ASP или любым другим языком скриптования, Вы уже знаете, что одна из самых замечательных особенностей этих языков - возможность совмещать обычный HTML код с выражениями, присущими этим языкам, такими как переменные и вызовы функций.","uri":"/ukr/faq/articles/web-razrabotka-s-pomoschju-fasttemplate/"},{"article_date":"01.04.2020","article_voteavg":"","article_views":"","article_title":"Как мониторить сервер с помощью Zabbix?","article_preview":"<p>Грамотно настроенный мониторинг серверов, является своеобразной козырной картой в рукаве администратора. В данной статье мы рассмотрим установку и первоначальную настройку мониторинга средствами Zabbix. Он позволяет осуществлять мониторинг состояния сервера в целом, состояние его отдельных приложений, сетевого коммутационного оборудования, а также аппаратной части.</p>","uri":"/ukr/faq/articles/kak-monitorit-server-s-pomoschju-zabbix/"},{"article_date":"25.05.2021","article_voteavg":"","article_views":"","article_title":"Что нового в Ubuntu 21.04 ‘Hirsute Hippo’?","article_preview":"<p>22 апреля компания Canonical выпустила обновлённую версию операционной системы, Hirsute Hippo. Она стала переходной версией популярного дистрибутива Linux, которая поддерживается Canonical. Заслуживает ли она внимания?</p>","uri":"/ukr/faq/articles/chto-novogo-v-ubuntu-2104-hirsute-hippo/"}]}